saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.LPC4000_DFP.2.1.0.pdsc
        <!-- *************************  Device 'LPC4078FET208'  ***************************** -->
        <device Dname="LPC4078FET208">
          <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="120000000"/>
          <compile header="Device/Include/LPC407x_8x_177x_8x.h"  define="CORE_M4"/>
          <debug      svd="SVD/LPC408x_7x.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x10000"    init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/LPC_IAP_512.FLM"    start="0x00000000"  size="0x80000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>

          <feature type="MemoryOther"   n="1"                           name="4032 Bytes EEPROM"/>
          <feature type="ETH"           n="1"       m="100000000"/>
          <feature type="USBOTG"        n="1"/>
          <feature type="UART"          n="5"/>
          <feature type="PWM"           n="6"/>
          <feature type="BGA"           n="208"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'LPC408x'  **************************** -->
      <subFamily DsubFamily="LPC408x">
        <book       name="Documents/UM10562.pdf"                          title="LPC4000 Series Reference Manual"/>
        <book       name="Documents/LPC408X_7X_DS.pdf"                    title="LPC4000 Series Datasheet"/>
        <book       name="Documents/LPC407X_8X_ES.pdf"                    title="LPC4000 Series Erratasheet"/>

        <feature type="MemoryOther"   n="1"                           name="4032 Bytes EEPROM"/>
        <feature type="GLCD"          n="1"       m="1024.768"        name="LCD Controller (1024x768x24) for STN and TFT"/>
        <feature type="ETH"      n="1"       m="100000000"/>
        <feature type="USBOTG"        n="1"/>
        <feature type="UART"          n="5"/>
        <feature type="PWM"           n="6"/>

        <!-- *************************  Device 'LPC4088FBD144'  ***************************** -->
        <device Dname="LPC4088FBD144">
          <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="120000000"/>
          <compile header="Device/Include/LPC407x_8x_177x_8x.h"  define="CORE_M4"/>
          <debug      svd="SVD/LPC408x_7x.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x10000"    init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/LPC_IAP_512.FLM"    start="0x00000000"  size="0x80000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>

          <feature type="QFP"           n="144"/>
        </device>

        <!-- *************************  Device 'LPC4088FBD208'  ***************************** -->
        <device Dname="LPC4088FBD208">
          <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="120000000"/>
          <compile header="Device/Include/LPC407x_8x_177x_8x.h"  define="CORE_M4"/>
          <debug      svd="SVD/LPC408x_7x.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x10000"    init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/LPC_IAP_512.FLM"    start="0x00000000"  size="0x80000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>

          <feature type="QFP"           n="208"/>
        </device>

        <!-- *************************  Device 'LPC4088FET180'  ***************************** -->
        <device Dname="LPC4088FET180">
          <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="120000000"/>
          <compile header="Device/Include/LPC407x_8x_177x_8x.h"  define="CORE_M4"/>
          <debug      svd="SVD/LPC408x_7x.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x10000"    init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/LPC_IAP_512.FLM"    start="0x00000000"  size="0x80000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>

          <feature type="BGA"           n="180"/>
        </device>

        <!-- *************************  Device 'LPC4088FET208'  ***************************** -->
        <device Dname="LPC4088FET208">
          <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="120000000"/>
          <compile header="Device/Include/LPC407x_8x_177x_8x.h"  define="CORE_M4"/>
          <debug      svd="SVD/LPC408x_7x.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x10000"    init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/LPC_IAP_512.FLM"    start="0x00000000"  size="0x80000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>

          <feature type="BGA"           n="208"/>
        </device>
      </subFamily>

    </family>
  </devices>

  <boards>
    <board vendor="Embedded Artists" name="LPC4088-32 Developers Kit" revision="Ver 1.3" salesContact="http://www.embeddedartists.com/contact" orderForm="http://www.embeddedartists.com/products/kits/lpc4088_kit.php">
      <description>Embedded Artists LPC1788-32 Developers Kit</description>
      <image small="Documents/kit_lpc4088_small.jpg" large="Documents/kit_lpc4088_large.jpg"/>
      <book category="overview"  name="http://www.embeddedartists.com/products/kits/lpc4088_kit.php" title="LPC4088 Developer's Kit Web Page"/>
      <book category="manual" name="Documents/LPC4088_OEM_Board_Datasheet.pdf" title="Data Sheet"/>
      <book category="manual"    name="Documents/LPC4088_OEM_Board_Users_Guide.pdf" title="User Manual"/>
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="LPC4088FET208"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" DsubFamily="LPC408x"/>
      <feature type="XTAL"            n="12000000"/>
      <feature type="PWR"             n="5"              name="USB Powered"/>
      <feature type="MemCard"         n="1"              name="microSD Card Holder"/>
      <feature type="Proto"           n="4"              name="Prototyping areas connected to I/Os"/>
      <feature type="DIO"             n="70"             name="Digital I/Os (depending on configuration)"/>
      <feature type="USB"             n="1"              name="USB 2.0 Full-speed Host/OTG interface (USB Host connector)"/>
      <feature type="USB"             n="1"              name="USB 2.0 Full-speed Device interface (USB Device connector)"/>
      <feature type="CAN"             n="2"/>
      <feature type="RS232"           n="2"/>
      <feature type="ETH"             n="1"              name="10/100 Ethernet Port"/>
      <feature type="GLCD"            n="1"  m="240.320" name="2.4 inch Color QVGA TFT LCD with resistive touchscreen"/>
      <feature type="Poti"            n="1"              name="Potentiometer for ADC Input"/>
      <feature type="ConnOther"       n="1"              name="Speaker with amplifier"/>
      <feature type="Button"          n="2"              name="Push-Buttons: Reset, INT0 (external interrupt)"/>
      <feature type="LED"             n="8"              name="I/O Port LEDs"/>
      <feature type="CustomFF"        n="120" m="120"/>
      <debugInterface adapter="JTAG/SW" connector="20 pin JTAG (0.1 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="10 pin Cortex debug (0.05 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="20-pin Cortex debug + ETM Trace (0.05 inch connector)"/>
    </board>
  </boards>

  <conditions>
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="LPC40xx">
      <description>NXP LPC4000 Series devices</description>
      <require Dvendor="NXP:11" Dname="LPC40??*"/>
    </condition>

    <condition id="LPC40xx ETHERNET">
      <description>NXP LPC4000 Series devices with Ethernet Controller</description>
      <require Dvendor="NXP:11"/>
      <accept Dname="LPC4076*"/>
      <accept Dname="LPC4078*"/>
      <accept Dname="LPC408?*"/>
    </condition>

    <condition id="LPC40xx CMSIS">
      <description>NXP LPC4000 Series devices and CMSIS-CORE</description>
      <require condition="LPC40xx"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="LPC40xx CMSIS_Driver EMAC">
      <description>Requirement for CMSIS Ethernet MAC Driver</description>
      <require condition="LPC40xx ETHERNET"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="GPIO"/>
      <require Cclass="Device" Cgroup="PIN"/>
      <accept Cclass="CMSIS" Cgroup="RTOS"/>
      <accept Cclass="CMSIS" Cgroup="RTOS2"/>
    </condition>

    <condition id="LPC40xx CMSIS_Driver CAN I2C">
      <description>Requirement for CMSIS CAN and I2C Driver</description>
      <require condition="LPC40xx CMSIS"/>
      <require Cclass="Device" Cgroup="PIN"/>
    </condition>

    <condition id="LPC40xx CMSIS_Driver MCI SPI">
      <description>Requirement for CMSIS MCI and SPI Driver</description>
      <require condition="LPC40xx CMSIS"/>
      <require Cclass="Device" Cgroup="GPDMA"/>
      <require Cclass="Device" Cgroup="GPIO"/>
      <require Cclass="Device" Cgroup="PIN"/>
    </condition>

    <condition id="LPC40xx CMSIS_Driver SAI USART">
      <description>Requirement for CMSIS SAI and USART Driver</description>
      <require condition="LPC40xx CMSIS"/>
      <require Cclass="Device" Cgroup="GPDMA"/>
      <require Cclass="Device" Cgroup="PIN"/>
    </condition>

    <condition id="LPC40xx CMSIS_Driver USB">
      <description>Requirement for CMSIS USB Driver</description>
      <require condition="LPC40xx CMSIS"/>
      <require Cclass="Device" Cgroup="PIN"/>
    </condition>

    <condition id="LPC40xx EA_BSP ADC">
      <description>Requirement for EA BSP ADC Driver</description>
      <require condition="LPC40xx CMSIS"/>
      <require Cclass="Device" Cgroup="PIN"/>
    </condition>

    <condition id="LPC40xx EA_BSP Audio">
      <description>Requirement for EA BSP Audio Driver</description>
      <require condition="LPC40xx CMSIS"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C"/>
      <require Cclass="CMSIS Driver" Cgroup="SAI"/>
    </condition>

    <condition id="LPC40xx EA_BSP Button LED">
      <description>Requirement for EA BSP Button and LED Driver</description>
      <require condition="LPC40xx CMSIS"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C"/>
    </condition>

