saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.LPC4000_DFP.2.1.0.pdsc
    <condition id="LPC40xx EA_BSP GLCD LITTLE">
      <description>Requirement for EA BSP GLCD 320x240 Driver</description>
      <require condition="LPC40xx CMSIS"/>
      <require Cclass="Device" Cgroup="GPIO"/>
      <require Cclass="Device" Cgroup="PIN"/>
      <require Cclass="CMSIS Driver" Cgroup="SPI"/>
    </condition>

    <condition id="LPC40xx EA_BSP GLCD BIG">
      <description>Requirement for EA BSP GLCD 480x272 and 800x480 Driver</description>
      <require condition="LPC40xx CMSIS"/>
      <require Cclass="Device" Cgroup="GPIO"/>
      <require Cclass="Device" Cgroup="PIN"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C"/>
    </condition>

    <condition id="LPC40xx EA_BSP Joystick">
      <description>Requirement for EA BSP Joystick Driver</description>
      <require condition="LPC40xx CMSIS"/>
      <require Cclass="Device" Cgroup="GPIO"/>
      <require Cclass="Device" Cgroup="PIN"/>
    </condition>

  </conditions>

  <components>
    <!-- Device class -->

    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.1" condition="LPC40xx CMSIS">
      <description>System Startup for NXP LPC4000 Series</description>
      <files>
        <!-- include folder / file -->
        <file category="header" name="Device/Include/LPC407x_8x_177x_8x.h"/>

        <!-- startup / system file -->
        <file category="source" name="Device/Source/ARM/startup_LPC407x_8x_177x_8x.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/Source/system_LPC407x_8x_177x_8x.c"       attr="config" version="1.0.1"/>
        <file category="header" name="Device/Include/system_LPC407x_8x_177x_8x.h"      attr="config" version="1.0.0"/>

        <!-- device configuration required by drivers -->
        <file category="header" name="RTE_Driver/Config/RTE_Device.h"                  attr="config" version="2.0.0"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="GPDMA" Cversion="1.0" condition="LPC40xx CMSIS">
      <description>GPDMA driver used by CMSIS Drivers for LPC4000 Series</description>
      <files>
        <file category="header" name="RTE_Driver/GPDMA_LPC40xx.h"/>
        <file category="source" name="RTE_Driver/GPDMA_LPC40xx.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="GPIO" Cversion="1.0" condition="LPC40xx CMSIS">
      <description>GPIO driver used by CMSIS Drivers for LPC4000 Series</description>
      <files>
        <file category="header" name="RTE_Driver/GPIO_LPC40xx.h"/>
        <file category="source" name="RTE_Driver/GPIO_LPC40xx.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="PIN" Cversion="1.0" condition="LPC40xx CMSIS">
      <description>Pin Connect driver used by CMSIS Drivers for LPC4000 Series</description>
      <files>
        <file category="header" name="RTE_Driver/PIN_LPC40xx.h"/>
        <file category="source" name="RTE_Driver/PIN_LPC40xx.c"/>
      </files>
    </component>

    <!-- CMSIS Driver class -->
    <component Cclass="CMSIS Driver" Cgroup="CAN" Capiversion="1.0" Cversion="1.3" condition="LPC40xx CMSIS_Driver CAN I2C">
      <description>CAN Driver for LPC4000 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_CAN1                /* Driver CAN1 */
        #define RTE_Drivers_CAN2                /* Driver CAN2 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/CAN_LPC40xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="Ethernet MAC" Capiversion="2.1" Cversion="1.1" condition="LPC40xx CMSIS_Driver EMAC">
      <description>Ethernet MAC Driver for LPC4000 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_ETH_MAC0            /* Driver ETH_MAC0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/EMAC_LPC40xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.2" Cversion="1.0" condition="LPC40xx CMSIS_Driver CAN I2C">
      <description>I2C Driver for LPC4000 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_I2C0                /* Driver I2C0 */
        #define RTE_Drivers_I2C1                /* Driver I2C1 */
        #define RTE_Drivers_I2C2                /* Driver I2C2 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/I2C_LPC40xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="MCI" Capiversion="2.2" Cversion="1.0" condition="LPC40xx CMSIS_Driver MCI SPI">
      <description>MCI Driver for LPC4000 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_MCI0                /* Driver MCI0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/MCI_LPC40xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="SAI" Capiversion="1.0" Cversion="1.0" condition="LPC40xx CMSIS_Driver SAI USART">
      <description>SAI Driver for LPC4000 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_SAI0                /* Driver SAI0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/I2S_LPC40xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="SPI" Csub="SSP" Capiversion="2.1" Cversion="1.1" condition="LPC40xx CMSIS_Driver MCI SPI">
      <description>SPI Driver for LPC4000 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_SPI0                /* Driver SPI0 */
        #define RTE_Drivers_SPI1                /* Driver SPI1 */
        #define RTE_Drivers_SPI2                /* Driver SPI2 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/SSP_LPC40xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.1" Cversion="1.2" condition="LPC40xx CMSIS_Driver SAI USART">
      <description>UART Driver for LPC4000 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USART0              /* Driver USART0 */
        #define RTE_Drivers_USART1              /* Driver USART1 */
        #define RTE_Drivers_USART2              /* Driver USART2 */
        #define RTE_Drivers_USART3              /* Driver USART3 */
        #define RTE_Drivers_USART4              /* Driver USART4 */
        </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/UART_LPC40xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="USB Device" Capiversion="2.1" Cversion="1.0" condition="LPC40xx CMSIS_Driver USB">
      <description>USB Device Driver for LPC4000 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBD0               /* Driver USBD0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/USBD_LPC40xx.c"/>
        <file category="source" name="RTE_Driver/OTG_LPC40xx.c"/>
      </files>
    </component>

